// ignore: non_constant_identifier_names
String liushu_xingsheng() {
  return '''
 <div class="sw">
            <span class="title">形聲者，</span><br>
            以事爲名，取譬相成，<br>
            江河是也。

            <div class="bottom">-------------《說文解字》</div>
        </div>

        形聲結構是使用與意義相關的形符，加上一個記錄語音的聲符來構成文字符號的方法。<br><br>
        我們需要注意的是，漢字在創造出來以前，我們的祖先已經會說話了。所以漢字是先有聲，後有形。一個字，只有先有一個概念，有一個念法，然後才能被造出來。如果一個字都沒有一個念法，那造出來該怎麼稱呼它呢？造一兩個字還好，如果造了一百個字，一千個字，那該怎麼區分這麼多的概念？而且這些概念不是自己用的，是用來交流的，是大家一起用的，所以就算字是一個人造出來的，你自己可以明白其中的含義，但是如何表達給其他人聽呢？如果沒有語言，沒有一套成熟的溝通語言，就算你表達出了其中的意思，又怎麼能明白對方通曉了你所表達的意思呢？顯然是不可能的。<br><br>
        文字的出現，必然標識著文明進入了一個新的階段，在這個階段之前，必然積累了許許多多的經驗，所以，在文字出現之前，我們的祖先已經擁有了對文字相當豐厚的積累。我們說倉頡造字，更有可能的是，倉頡是一位集大成者，他將前人對文字的積累進行編輯分類，去粗存精，然後就有了文字的統一規範。就如同《說文解字》的作者許慎，在許慎之前，已經有他的老師，以及許多大師對文字作了相當多的研究，然後許慎才能將大量的文字研究成果進行編輯成冊，傳諸後世。不知諸位看官以為如何呢？<br>
        
        <br>
        如：<br><br>
        <span class="jgwiconfont jgw-iconjian3 bigFont"></span>（澗）<br>
        左邊的<span class="jgwiconfont jgw-iconshui1 shiyiJgwNormalFont"></span>（水）是“形”，表示這個字字義與“水”有關。<br>
        右邊的<span class="jgwiconfont jgw-iconxian1 shiyiJgwNormalFont"></span>（閒）是“聲”，表示這個字發聲與“閒”有關。我們首先要明確一點，我們為什麼要造“澗”這個字。我們不是看到了某一個事物或某一個景象就去造一個字。我們前面也說過了，就算我們造出了一個字，那麼這個字應該怎麼唸呢？所以字不是隨便造的，我們之所以要造一個字，是因為我們都認識他，都知道有一個大家都懂得的聲音，為了記錄這樣的一個聲音，然後為這個聲音造一個符號。所以我們不妨給文字下一個定義：文字是記錄語音的符號。所以，我們是先有了“澗”這個口語，然後再為他造一個符號。此處我們討論的是使用形聲法來構建一個漢字，故要用某個字作爲聲符，那為什麼要用“間”這個字作聲符呢？我們已經說過，字被造出來之前，人已經會說話了，所以既然已經有了“間”這個字，這個字必然有一個唸法，已經有一個固定的發音在那裡了。我們再仔細一想，同音字可能會有許許多多，那爲何要偏偏用這個“間”字呢？我們不妨來揣測一下造字人的想法：既然有很多發音一樣的字，那是不是選一個還能表達意義的字更好呢？即：這個聲符，既表音，也表義。
        <br>於是：
        <br><br>“閒”也表意，“閒”的意思是門有間隙，月光從門隙裡照進來。所以“閒”是間隙的意思，我們平常說一個人閒得沒事幹，這個“閒”就是“生活的間隙”，不用時時刻刻都在工作。那“澗”是什麼意思呢？想像一下走在山裡，有山泉從山上流下來，這個就叫作“澗”，石頭的隙裡，有水流過。廣州的白雲山上，刻有一首詩，其中一句是“桃源定在深處，澗水浮來落花。”，這個“澗水”，就很形象了。<br>
        
        <br>
        <span class="jgwiconfont jgw-iconmai bigFont"></span>（脈）<br>
        左邊的<span class="jgwiconfont jgw-iconrou shiyiJgwNormalFont"></span>（肉）是“形”，表示這個字字義與“肉”有關。<br>
        右邊的<span class="jgwiconfont shiyiJgwNormalFont"></span>（𠂢/永）是“聲”，表示這個字發聲與“𠂢/永”有關。
        <br><br><span class="jgwiconfont shiyiJgwNormalFont"></span>是河流的一條分支，所以“脈”就是血液、神經的分支。後來造了“派”字，而“派”也是形聲兼會意，它表示是河流的一條分支。它反過來是<span class="jgwiconfont jgw-iconyong shiyiJgwNormalFont"></span>（永），左右是不區分的，只不過後來區分開來。所以“脈”也寫作“脉”，但是如果寫作“脉”則“永”不具備“音”的效用，所以傳統漢字以“脈”爲標準字，既表音也表義，很可惜的是，簡化字使用“脉”作為標準字，失去了音的效用。<br>
        <br>

        <br>
        當然，並不是所有的形聲字的聲符都具有表義的作用，有一些字是特例，只表音，比如元素週期表中的多數形聲字的聲符僅僅具有音的效用。
        <br>
        <br>
        <div class="desc">
            大多數的形聲字的聲符，既表音也表義，甚至有一些漢字形體不一樣，但發音一樣，表達的意思卻也一樣，如“洪”、“宏”、“鴻”等字都有表示“大”的意思。於是有許多大師開始思考，漢字的聲音是否也能探究漢字意義的本源呢？畢竟人是先會講話的，在文字沒有產生之前，大家都是用的同一種語音系統進行溝通。
            一個音，就表示一個義，是不是很有效的溝通，不會導致歧義呢？而且古籍越古老，單音節詞就越多。這是否能爲我們提供一些證據，說明單音節詞是當時有效的溝通途徑？因為用同一個聲符造出來的漢字，音必然相同或相近，既然單音節詞是不會引起歧義的，那麼這些字同義或近義，應該是可以說得通的。那聲符，就能有效地說明漢字的本源，即聲符示源。
        </div>

        <br>
        <div class="desc">
            形聲字佔了90%以上的比例，是最常見的漢字字形。我們現在依然使用形聲來構字，比如元素週期表中的：氫、氦等，都是形聲字。如果沒有形聲字，很難確定漢字會如何發展，說不定也像其他文明一樣，跟不上時代的發展而被淘汰了。
        </div>

        <br><br>
        到這裡，我們一定要認識到，文字是記錄語音的符號。然後我們再回過頭去看象形、指事、會意字，才能明瞭字是怎麼造的。比如，我們不是看到了大象，要去造一個“象”字，而是我們的語音系統中有“象”這個聲音，然後為這個聲音造的這個字。又如刃字，你說為什麼要單獨為刀刃造一個字？不是要為刃這個東西造一個字，而是我們有這個語音，才造的符號，這樣才合乎邏輯。還有會意字，你說為什麼要用奇奇怪怪的幾個符號組成另一個符號？這本身就很奇怪，我們不是在玩漢字積木吶。合乎的邏輯的應該是，生活中有某個語音，然後我們為這個語音造一個字，只是選用了“會意”這種方法來造字而已。
        <br><br>
        有了這個認識，我們就能了解為什麼漢字這麼多。康熙字典有幾萬漢字呢，加上許多異體字，漢字總共有十幾萬字。可是我們常用的才幾千個字，那些多出來的奇奇怪怪的字哪來的？從語音的角度出來，我們就能解釋了，這些漢字是各個不同語音系統的地方的人造的。我們中國方言很多啊，甚至於說一個村一種話都有，比如我們村和隔壁村說的就不是一種方言，而且差異還很大，我至今也沒有能聽懂他們說的話。所以當我們寫文章記事時，如果現有文字無法記錄我們本地的這個語音，我們就有可能自己去造這個字，這便是漢字非常非常多的原因之一。如果不想造字，而現有文字有語音類似的，便可用假借表示（我們後面會討論），而不必造新字，這個可不是亂說的哦，揚雄《方言》則為證據，如：嫁、逝、徂、適:往也。自家而出謂之嫁，由女而出爲嫁也。逝，秦晉語也。徂，齊語也。適，宋魯語也。同樣是“嫁”的意思，秦用“逝”字，齊用“徂”字。為什麼用不同的字呢？因為他們語言不同吶，同樣的意思，發音不一樣，所以當然會用不一樣的符號了。
        又比如說，“荷花”、“蓮花”，為什麼同一種植物，要用不同的字呢？如果是甲地方的人，該植物發“荷”的音，乙地方的人，該植物發“蓮”的音，是不是就很合理了呢？當然這從邏輯上說得過去，實際上是不是呢？還要從實際上去論證考證。
        即便是同一個語音系統的人，不同地方的人發音也還有可能不一樣的。比如“崖”字，大陸唸“ya2”，臺灣香港地區則較多唸“yai2”。各位去看下呂頌賢版的《笑傲江湖》，仔細聽一下“思過崖”的發音，我當時聽了就覺得奇怪，是不是配音配錯了？還有，也可以聽下周杰倫的《愛情懸崖》、范瑋琪的《最初的夢想》，裏面的“崖”均發“yai2”的音。
        從空間上來說，也有可能是不正確的。還有一種可能是，從時間上來說，語音也會發生改變。比如，以前某個字，發某個音，到現在變了，現在再用這個符號去唸，就覺得不太對，所以用另一個表示現在音的符號再造了一個新字。語音變化，我們現在就能看到很多，比如“角色”，很多人唸“攪色”。又比說，“說服”，也越來越多人唸說話的說。還有“父爸”二字，“爸”字就是後造的了。
        <br><br>
        <div class="jianhuazi">
            簡化字對形聲字的破壞
            <br><br>

            漢、嘆、歎、難、僅、雞、歡、觀、勸，<br>被簡化成：<br>
            汉、叹、叹、难、仅、鸡、欢、观、劝。<br><br>
            
            看“觀”字，“雚”被簡化成“又”，但是“灌”字並沒有被簡化，因為一簡化，發現“灌溉”變成“汉溉”了，和“漢”字有了衝突。<br><br>

            看“僅”字，“堇”被簡化成“又”，但是“勤”等字並沒有被簡化，因為一簡化，“勤奮”變成“劝奋”了，和“勸”字有了衝突。<br><br>

            還有許多許多的簡化字，但僅從上面這些簡化字來看，就能看出來簡化字毫無系統性，感覺就像是隨隨便便搞出來的，根本沒有考慮到眾多漢字的混淆性。
            而且我們知道“又”是一隻手的形狀，在傳統漢字中，我們看到“又”字，基本上就能聯想到和“手”相關的意思，如“受”字等，但是如此一簡化，導致這種字義的混淆、形聲的破壞，
            更加增加了學習的難度，我們根本就沒有規律去掌握一個漢字的書寫方法，只能靠死記硬背，這一橫怎麼寫，那一豎怎麼寫，豈不是增加了學習的難度麼。
        
            <br><br>
            我們再來看一個字：“讚”。我們要讚揚一個人，要用什麼去讚揚？當然用好聽的話啦，所以讚揚的讚是言字旁。<br>
            我們要辦一個活動，要去拉贊助商，贊助商用什麼贊助？贊助商不能說幾句漂亮話，讚揚讚揚你們就行了吧，得拿出實實在在的東西呀。什麼東西最實在？錢呀，所以贊助的贊是貝字旁。
            <br><br>
            讚、贊簡化爲“赞”後，毫無趣味性可言。

        </div>

        <br><br><br>
        繼續學習 <a href="jgw://liushu/5">&nbsp;&nbsp;&nbsp;&nbsp;六書-轉注&nbsp;&nbsp;&nbsp;&nbsp;</a>
        <br><br><br>
 ''';
}
