// ignore: non_constant_identifier_names
String liushu_jiajie() {
  return '''
 <div class="sw">
            <span class="title">假借者，</span><br>
                本無其字，依聲託事，<br>
                令長是也。

            <div class="bottom">-------------《說文解字》</div>
        </div>

        本來沒這個字，後來根據讀音相近的字，借過來表示。有可能是這個字太虛了，不像門、戶、桌子等東東很實在，大家都看得到摸得著，太難造，所以就從讀音相近的字借過來表示。
        
        <br><br>
        我們來看一個字：<br>

        <span class="jgwiconfont jgw-iconbei1 bigFont"></span>（北）<br>
        兩個人背對背站著，本義就是“背”的意思。比如我們常說的“追亡逐北”、“敗北”，打仗的時候，兩個人是面對面地打架，打著打著，你覺得打不過了，轉身就跑，這時候我看到的就是你的背，那我追的就是你的背，所以叫“逐北”。後來“北”被借用爲北方的“北”，那背字就沒了，怎麼辦呢？在北的基礎上加一塊肉
        <span class="jgwiconfont jgw-iconrou shiyiJgwNormalFont"></span>，變成了<span class="jgwiconfont jgw-iconbei2 shiyiJgwNormalFont"></span>。
        <br><br>
        漢字假借，看起來更多的像是漢字的用法，而不是造字的方法。<br>
        這在我們生活當中隨處可見，比如我曾經見過一個店名“吹牛啤”，不用進去我應該也能猜到這個是喝啤酒的地方了。<br>
        又比如非常流行的諧音梗，如：開猿節流、降本增笑等，都可視為是漢字的假借。

        <br><br><br>
        <div class="desc">
            到這裏，我們已經學了六書：象形、指事、會意、形聲、轉注、假借等構字方法，發現漢字具有形、聲、意三個非常重要的東西。<br><br>

            形，即形狀。有了形狀，我們就可以知道幾千年甚至幾萬年以前的人的工具、武器、房子等等長成什麼模樣，如：<br>
            <span class="jgwiconfont jgw-iconmin shiyiJgwNormalFont"></span>（皿），器皿。<br>
            <span class="jgwiconfont jgw-iconshi8 shiyiJgwNormalFont"></span>（豕），就是豬。<br>
            <span class="jgwiconfont jgw-iconniao shiyiJgwNormalFont"></span>（鳥）。我們看現在的豬、鳥，和古代的動物都長一樣，說明沒有發生基因突變。<br>

            <br><br>
            音，即聲音，發音。這個非常厲害，古代沒有錄音機，聲音沒辦法錄下來，但巧的是，漢字本身就記錄了聲音，能讓我們回溯，知道古人是如何發音的。如果你不是古文專業的同學，在網上看到老教授在講課，有可能發現他們的發音可能不是很標準的普通話，您不要隨便去糾正他們，他們有可能發的是“古音”。有一門專門研究這個的學問，喚作“音韻學”，有興趣的同學可以瞭解下。<br><br>

            研究這個發音，還有一個非常重要的意義，因爲漢字會有假借，聲音相近，就借過來用，久借不還，就成了約定俗成的標準字了，如上面說的“北”字。知道漢字的古音後，對於尋找漢字的演變有非常重要的作用，形聲字、假借字都有聲音，如果不知道古音，就很難判斷了。比如“者”字，用“者”構建的漢字：諸、豬、渚、著、箸、褚、堵、賭等，這些字普通話都發u的音，怎麼“者”發e的音呢？若不通古音，則不解，因爲構建這些字的時候，是以當時的發音作爲參考的。
            <br><br><br>
            意，即意思、意義。這個也非常厲害，通過這些造字表示的意思，我們就能知道幾千年、幾萬年以前的人的生活形態。如：<br>
            <span class="jgwiconfont jgw-iconxie shiyiJgwNormalFont"></span>（血），器皿中的血，用於祭祀，通過這個字就能看出古代祭祀要用血。<br>
            <span class="jgwiconfont jgw-iconzhu1 shiyiJgwNormalFont"></span>（逐），腳丫子追一頭豬，可以看出當時打野豬的情形。<br>

            <br><br>
            <br>
            通過這三點，發現漢字本身就是一部歷史，不需要額外的文字說明，它自己就形象、生動地表現出了當時的模樣。<br><br>我們的漢字是不是非常厲害！
        </div>

        <br><br><br>
        <div class="desc">
            我們再來說一下漢字簡化問題。<br><br>

            我們來看一些字的演變：<br>
            1.須->鬚，須本來指鬍鬚，後來借來表示“必須”意，但本義依然保留，後來爲了區分這兩種字義，加了義符“髟”。

            <br><br>
            2.采->採，采本來是一隻手在採摘，但是上方的手已經看不出來是一隻手的樣子了，所以再加“扌”表示與手有關。
            <br><br>

            3.云->雲，云本來是畫一朵云的樣子，後來借來表示“說話”，另造了“雲”字，加了義符“雨”，以區分兩者的字義。

            <br><br>

            4.游->遊，本來只有“游”字，後來爲了區分在水裡游，與在地上遊玩，造了“遊”，表示是陸地上的“遊”。

            <br><br>

            我們不難看出，漢字的發展，是不斷地加可識別的符號，讓意思更加明確，儘量不產生歧義。然而，簡化字把這種可識別的標識給去掉了，對我們造成了相當大的困擾，不得不說，簡化字的使用，對漢字的發展產生了極大的傷害與阻礙。<br><br>不知各位看官以爲如何？

            <br><br>
            我們覺得傳統漢字很好，想要恢復傳統漢字，應該怎麼做呢？<br>
            首先第一要做的，就是一定不要反對簡化字！這一點一定要明白，不要覺得簡化字不好，就強烈反對他。大家覺得周圍的人有多少使用傳統漢字的？可能10%都不到，如果我們去反對使用簡化字，就相當於10%的人去反對90%的人，其結果已不言而喻。
            況且，大部分人都是不懂得漢字六書的，即便很多喜歡傳統漢字的人，他也不清楚。所以，當我們強制他們去使用傳統漢字時，無疑大部分人都會反對，大部分人都反對的時候，這個項目還未開始就已經夭折了。
            所以我們首先要做的事情，就是一定不要去反對簡化字。相反，我們應該肯定簡化字的功績，肯定簡化字對中國發展、中國文化所做出的努力與貢獻，我們更應該承認簡化字的地位，既然他已經使用了幾十年，那麼他就是標準漢字，他就是正統漢字，他就是真真正正的中國字。
            <br>
            既然我們不能反對簡化字，還要肯定他，那麼我們該如何恢復傳統漢字呢？只一條就可以了：廢除一切對傳統漢字的限制，讓喜歡用傳統漢字的人用傳統漢字，讓喜歡用簡化字的人使用簡化字。具體不妨假設允許如下四條：
            <br>
            一、允許老師使用傳統漢字教學。<br>
            二、允許學生使用傳統漢字提交作業及考試。<br>
            三、允許各類名稱使用傳統漢字，如：個人姓名、公司名稱、地名等等。<br>
            四、允許政府及公眾公告使用傳統漢字。<br>
            只須不反對即可。特別是第一、二條最重要，當然這兩條也最容易引起反感。因為有些老師不認識傳統漢字，如果學生的作業都是傳統漢字，那他就比較討厭了。而喜歡傳統漢字的老師教傳統漢字，不喜歡的教簡化字，又容易讓學生迷惑，或是造成衝突。
            可是我們要知道啊，事情上沒有什麼事情是容易做成的，特別是一項偉大的事業，我們必須直面困難、頂住壓力、謙卑包容、奮發向上，才有可能做成。
            讓我們站在歷史的長河上高瞻遠矚，假設百年之後，傳統漢字得以恢復使用，而這裡面有我們為此付出的無數個日夜的辛勤汗水，有被周圍人不理解、甚至被唾棄的羞辱，而我們都為了這項神聖而偉大的事業忍辱忍下來，內心是否充滿了激動與感動？

        </div>

        <br><br><br>
        <div class="desc">
            最後說一下研究漢字有什麼用。<br><br>

            可能您要說，我就算不瞭解漢字構造，依然可以使用漢字正常讀寫，不影響生活學習呀，為什麼要學習漢字的構造與來源呢？事實確實是這樣。不過這就好比，我們不瞭解物理力學原理，我們依然可以很好地生活在地球上，我們懂得怎麼使用力氣，根本不需要瞭解力學原理呀。<br><br>是的，作為普通人，是沒有必要去瞭解，但是爲了人類的發展，必須有人要瞭解力學原理。同樣的道理，爲了中國的文化，也必須要有人瞭解漢字的原理。力學在支配著生活的方方面面，我們身在其中卻不知；漢字在影響著生活的方方面面，我們身在其中卻不知。
        
            <br><br>
            我們也可以從反面來思考一下，倘若將來沒有一個人懂得漢字的構造，不懂甲骨文，那麼誰還會懂得漢字的一筆一畫是什麼意思呢？怎麼由來的呢？這種方塊字到底有什麼好處、優勢呢？這不就是我們沒有學習漢字六書之前的疑問嗎？我想，在這種狀態下，如果有一個外國人來質問我們，你們中國人為什麼要用這麼古老、笨重、落後的文字？為什麼不用我們的拼音文字？全世界都在用拼音文字，中國為何如此特立獨行、冥頑不靈？我們該如何反駁呢？我們不妨在此冷靜思考幾分鐘，然後再繼續閱讀後面的文章。
            <br><br>
            漢字已經發展的很穩固了，但是世界在高速地發展，新鮮事物也層出不窮，我們如何來命名新事物成了一個難題。漢字不能像英文一樣，出現一個新事物，就造一個新的單詞，那會造成單詞膨脹。現在我們普通人學習1000-2000個漢字即可閱讀大部份資料，如果新的漢字不斷出現，漢字就會膨脹，我們需要學習上萬個漢字的時候，那無疑是個災難。而且漢字經歷了幾千年的發展，也已經基本上不需要造新漢字來實現新事物的命名，那就是通過漢字的組合。
        
            <br><br>
            舉例來說，引入外文：<br>
            義譯：computer-電腦、television-電視、network-網絡/網路。<br>
            音譯：topology-拓撲、AIDS-艾滋。
            <br><br>
            使用現有的漢字，組合起來表示一個新事物。這就有點像“會義”、“形聲”構字法，只不過我們沒有產生一個新的字，而產生了一個新的詞。<br><br>
            那麼問題來了，同義的漢字有許許多多，使用什麼樣的字來組合呢？大家可不要輕視這個問題，這個是關係到我們切身生活的。因為我們造了一個詞，是影響後世子孫的，而不是僅僅影響少數部分人，也不是影響幾年，而是會影響幾十年、幾百年甚至是幾千年的。
            <br><br>
            舉例來說，大陸使用“屏幕”，台灣使用“螢幕”表示電腦顯示屏。我們來分析一下：
            <br><br>“幕”是一塊布，“屏”是“屏障”、“屏蔽”、“屏風”，那麼“屏幕”，就是用來作擋板的布。
            <br><br>“螢”是螢火蟲，晚上螢火蟲出來，它的屁股會發光，有一個成語“囊螢映雪”，“囊螢”表示用一個袋子把許許多多螢火蟲裝起來，晚上的時候就能用它們發出來的光照亮書本看書了。所以“螢幕”指是的會發光的布。

            <br><br>各位看官，認為用“屏幕”好，還是用“螢幕”好呢？
            <br><br>有許多詞彙，大陸與台灣不同，雙方也並未統一，各用各的詞彙。
            這些詞彙制定後，就會成為標準，一直延用下去。
            詞造得好，當然就好；若造不好，該如何？
            如果要修改，用了幾十年的詞彙，說改就改了嗎？若改又要怎麼改呢？
            
            <br><br>百年大計瞭解一下。
        </div>

        <br><br><br>
        <div class="desc">
        最後再補充一點。我們剛剛學習的漢字六書，是前人的研究成果。我們學習的是別人的研究成果，這個道理要明白。在前人沒有研究清楚之前，漢字的構造依然是有很多人有迷惑的。
        甲骨文從發現至今，才一百多年。在此之前，古人對於漢字的認識還有許多不足或錯誤之處。用甲骨文與說文的解釋對比，發現很多說文的釋義是不正確的，起碼本義是不匹配的。所以我們生在這個時代是很幸運的，我們直接拿了別人的成果來學習了。
        甲骨文從發現，到破譯，不是那麼簡單的。如果您對甲骨文的發現與破譯等等工作感興趣，推薦您看王宇信《中國甲骨學》，這本書非常詳細地介紹了甲骨文的發展。比如像王國維，我未讀此書之前，以為他只是一位大學者，讀過此書後才明白他對甲骨文的發展做出了奠基性的工作。
        又比如，甲骨文的發現是一個十分曲折和艱難的過程，並不是說突然在某個地方發現了甲骨，然後發掘，然後破譯。沒有這麼順利的。剛開始是有農民在地裡發現甲骨，然後被賣到藥店，被用於製藥，稱為“龍骨”。我們以後來人的角度來看，被用於製藥的甲骨已不知有多少，實在是很可惜。
        後來才有人發現這些甲骨上的文字是古文字，然後重金收購，甲骨才從藥材轉變成古董。所以發現甲骨文的第一人至關重要，如果不是他及早發現甲骨的學術價值，甲骨會一直被當成藥材給賣掉，而且是一車一車地賣，越晚發現，甲骨被賣掉毀掉的就越多。而古董商為了暴利，又不會透露出土地方，甲骨被發現又有一段波折。更有甚者，有人製作假的甲骨出售，所以又有了辨偽甲骨的波折。
        我們還要站在歷史時間的角度上來看甲骨的發現，發現甲骨是西元1899年，當時正處清朝末年，中國內憂外患，外有列強欺凌，內有革命爆發，政府無暇處理這些事情吶，全都是民間仁人志士自發自費來挽救這曠世奇珍的。古董，大家可能都聽說過，貴！但基本上沒有什麼實用價值，所以在收購甲骨上花費大量金錢的人，甚至於傾盡家財而為挽救甲骨的人，真真正正是做到舍己救人、救國家、救社會。甲骨文還有許許多多的故事，您感興趣的話，買一套書來看吧。
         <br><br>
          好了，小子說到這裡了~
        </div>

        <br><br><br>
        <h1>恭喜學完六書。</h1>
        <br><br><br>
 ''';
}
